# Дан список чисел – [8, 4, 7, 3, 9, 2, 5].
#
# Напишите программу, выводит все значения из этого списка на экран – каждое значение с новой строки.

numbers = [8, 4, 7, 3, 9, 2, 5]

for number in numbers:
    print(number)

print('==================')
mult = 1
for i in range(1,6):
    mult *= i
print(mult)
print('==================')

