# Task 1.
# Напишите программу, которая выводит на экран числа от 10 до 19.

counter = 10
while counter <= 19:
    print(counter)
    counter += 1