# Task 2.
# Напишите программу, которая запрашивает у пользователя
# имя, название улицы и номер дома, а затем выводит на экран строку по образцу:
# "Вас зовут Аркадий, и Вы живёте по адресу: ул. Гоголя, д. 7."

name = input("Имя: ")
street = input("Улица: ")
house_number = input("Номер дома: ")

print(f"Вас зовут {name}, и Вы живёте по адресу: ул. {street}, д. {house_number}.")
